attacker145/CC3200-Client/main_v42x.c

#include <string.h>
#include <stdlib.h>
#include <stdio.h>
// SimpleLink includes
#include "simplelink.h"

// driverlib includes
#include "hw_ints.h"
#include "hw_types.h"
#include "rom.h"
#include "rom_map.h"
#include "prcm.h"
#include "utils.h"
#include "interrupt.h"
#include "adc.h"
#include "pin.h"

// common interface includes
#include "uart_if.h"
#include "uart.h"
#include "common.h"
#include "pinmux.h"
#include "i2c_if.h"
#include "hw_memmap.h"
#include "gpio.h"
//#include "serial_wifi.h" //not good
//#include "tmp006drv.h"
//#include "bma222drv.h"

#include "gpio_if.h"
#include "network_if.h"
// HTTP Client lib
#include <http/client/httpcli.h>
#include <http/client/common.h>
// JSON Parser
#include "jsmn.h"
#include <math.h>
#include "wdt.h"
#include "wdt_if.h"
#include "serial_wifi.h"

#define cred

#define APPLICATION_VERSION "2.15x"
#define APP_NAME            "Sensors v2.15x."

//#define POST_REQUEST_URI  "/post"
//#define POST_REQUEST_URI  "/post.html"

#include "network_defines.h"

#include "button_if.h"

#define PROXY_IP            <proxy_ip>
#define PROXY_PORT          <proxy_port>

//#define READ_SIZE           1450
#define MAX_BUFF_SIZE       1460
#define SH_GPIO_0           0       //WiFi En
#define SH_GPIO_3           3       /* P58 - Light Sensor */
#define SH_GPIO_6           6       /* P61 - Light Sensor */
#define SH_GPIO_7           7       /* P62 - BLE data ready */
#define SH_GPIO_9           9       // Red LED
#define SH_GPIO_10          10      // Orange LED
#define SH_GPIO_11          11      // Green LED
#define SH_GPIO_13          13      //SW3
#define SH_GPIO_22          22      /* PIN_15 - Device Mode */
#define SH_GPIO_12          12      /* PIN_03 - AK9753A INT */
#define SH_GPIO_30          30      /* PIN_53 - I2C bus PWR EN */
//*****************************************************************************
//
// Values that can be passed to I2COpen as the ulMode parameter.
//
//*****************************************************************************
#define I2C_MASTER_MODE_STD     0
#define I2C_MASTER_MODE_FST     1

//*****************************************************************************
// BMA222 Device I2C address
//*****************************************************************************
#define BMA222_DEV_ADDR          0x18

#define BMA222_CHID_ID_NUM       0x00

//*****************************************************************************
// BMA222 Acc Data Register related macros
//*****************************************************************************
#define BMA222_ACC_DATA_X_NEW   (0x2)
#define BMA222_ACC_DATA_X       (0x3)
#define BMA222_ACC_DATA_Y_NEW   (0x4)
#define BMA222_ACC_DATA_Y       (0x5)
#define BMA222_ACC_DATA_Z_NEW   (0x6)
#define BMA222_ACC_DATA_Z       (0x7)

//*****************************************************************************
// TMP006 Device I2C address
//*****************************************************************************
#define TMP006_DEV_ADDR         0x41 //ADDR0 = 1, ADDR0 = 0 - 100 0001

//*****************************************************************************
// TMP006 Register offset address
//*****************************************************************************
#define TMP006_VOBJECT_REG_ADDR         0x0
#define TMP006_TAMBIENT_REG_ADDR        0x1
#define TMP006_CONFIG_REG_ADDR          0x2
#define TMP006_MANUFAC_ID_REG_ADDR      0xFE
#define TMP006_DEVICE_ID_REG_ADDR       0xFF

//*****************************************************************************
// TMP006 Device details
//*****************************************************************************
#define TMP006_MANUFAC_ID       0x5449
#define TMP006_DEVICE_ID        0x0067

//*****************************************************************************
//                      MACRO DEFINITIONS
//*****************************************************************************
#define FAILURE                 -1
#define SUCCESS                 0
#define RET_IF_ERR(Func)        {int iRetVal = (Func); \
                                 if (SUCCESS != iRetVal) \
                                     return  iRetVal;}

//*****************************************************************************
// BMA222 Data Interpretation macros
//*****************************************************************************
#define RESOLUTION_8BIT         ((float)(1.999 / 127))  //+-2g
#define G_VAL                   ((float)9.7798)

#define NO_OF_SAMPLES       128 //ADC

//#define WD_PERIOD_MS                 1000
//#define WD_PERIOD_MS                 20000 //20 secs
#define WD_PERIOD_MS                 2000
//#define WD_PERIOD_MS                 4000
#define MAP_SysCtlClockGet           80000000
#define LED_GPIO                     MCU_RED_LED_GPIO    /* RED LED */
#define MILLISECONDS_TO_TICKS(ms)    ((MAP_SysCtlClockGet / 1000) * (ms))
#define SH_GPIO_00              0

#define wrt_range 0x51

#define alarm_on  0
#define alarm_off 1

//Valid sensor modes - Register ECNTL1
#define AK975X_MODE_STANDBY 0b000
#define AK975X_MODE_EEPROM_ACCESS 0b001
#define AK975X_MODE_SINGLE_SHOT 0b010
#define AK975X_MODE_0 0b100
#define AK975X_MODE_1 0b101
#define AK975X_MODE_2 0b110
#define AK975X_MODE_3 0b111
//Valid digital filter cutoff frequencies
#define AK975X_FREQ_0_3HZ 0b000
#define AK975X_FREQ_0_6HZ 0b001
#define AK975X_FREQ_1_1HZ 0b010
#define AK975X_FREQ_2_2HZ 0b011
#define AK975X_FREQ_4_4HZ 0b100
#define AK975X_FREQ_8_8HZ 0b101
#define sleep
//#define AK975
//#define WD_PERIOD_MS                 5000
#define MAP_SysCtlClockGet           80000000
#define LED_GPIO                     MCU_RED_LED_GPIO    /* RED LED */
#define MILLISECONDS_TO_TICKS(ms)    ((MAP_SysCtlClockGet / 1000) * (ms))
#define FOREVER                      1
#define array_size 51
#define AK975

