attacker145/CC3200-Client/main_v42x.c
volatile float g_accXIntervalSum = 0;
volatile float g_accYIntervalSum = 0;
volatile float g_accZIntervalSum = 0;
volatile long long g_accSampleCount = 0;

volatile float g_accTotalAvg;
volatile float g_accXAvg;
volatile float g_accYAvg;
volatile float g_accZAvg;

unsigned char pause = 0;

//unsigned long pulAdcSamples[4096];//ADC
unsigned char BLE_timeout = 0;
volatile unsigned long g_ulTimerInts = 0;
//static unsigned char g_ucDryerRunning = 0;

char Rx_buf[10];
//*****************************************************************************
//
// API Function prototypes
//
//*****************************************************************************
extern int I2C_IF_Open(unsigned long ulMode);
extern int I2C_IF_Close();
extern int I2C_IF_Write(unsigned char ucDevAddr,
             unsigned char *pucData,
             unsigned char ucLen,
             unsigned char ucStop);
extern int I2C_IF_Read(unsigned char ucDevAddr,
            unsigned char *pucData,
            unsigned char ucLen);
extern int I2C_IF_ReadFrom(unsigned char ucDevAddr,
            unsigned char *pucWrDataBuf,
            unsigned char ucWrLen,
            unsigned char *pucRdDataBuf,
            unsigned char ucRdLen);
extern void GPIO_IF_GetPortNPin(unsigned char ucPin, unsigned int *puiGPIOPort, unsigned char *pucGPIOPin);
extern void GPIO_IF_GetPortNPin(unsigned char ucPin, unsigned int *puiGPIOPort, unsigned char *pucGPIOPin);
extern unsigned char GPIO_IF_Get(unsigned char ucPin, unsigned int uiGPIOPort, unsigned char ucGPIOPin);
extern void GPIO_IF_LedOff(char ledNum);
extern int BlockRead_(unsigned char ucRegAddr, unsigned char *pucBlkData, unsigned char ucBlkDataSz);
extern int GetRegisterValue_(unsigned char ucRegAddr, unsigned char *pucRegValue);
extern int SetRegisterValue_(unsigned char ucRegAddr, unsigned char ucRegValue);
extern int BMA222Close_();
extern int BMA222Read_(signed char *pcAccX, signed char *pcAccY, signed char *pcAccZ);
extern int BMA222ReadNew_(signed char *pcAccX, signed char *pcAccY, signed char *pcAccZ);
extern void MessageUART1(const char *str);
extern void InitTermUART1();
extern int GetCmdUART1(char *pcBuffer, unsigned int uiBufLen);
extern int BMA222Open_();
extern void AccSample_();
extern void SetAccAvg_();
extern int GetRegisterValue_temp_(unsigned char ucRegAddr, unsigned short *pusRegValue);
extern int TMP006DrvOpen_();
extern double ComputeTemperature_(double dVobject, double dTAmbient);
extern int TMP006DrvGetTemp_(float *pfCurrTemp);
//extern int BMA222Open_();
//extern unsigned short itoa(short cNum, char *cString);

extern void on_gpio7_int(void);
extern void gpio_int_init (void);
extern void init_adc (void);

extern void TimerRefIntHandler(void);
extern void TimerBaseIntHandler(void);
extern void timerA0_start(unsigned long ms);
extern void timerA0_stop(void);
extern void credentials (void);

extern void AK9753_ID (void);

extern void WDT_IF_Init(fAPPWDTDevCallbk fpAppWDTCB, unsigned int uiReloadVal);
extern void WDT_IF_DeInit(void);
extern void WatchdogIntHandler(void);
extern void PerformPRCMSleepGPTWakeup();
extern void EnterHIBernate();
extern long Network_IF_DeInitDriver(void);
void GPIO_IF_Toggle(unsigned char SH_GPIO_XX);
extern void AK975XsetMode(unsigned char mode);
extern int AK9753AReadData(unsigned char *IR1L_, unsigned char *IR1H_,
        unsigned char *IR2L_, unsigned char *IR2H_,
        unsigned char *IR3L_, unsigned char *IR3H_,
        unsigned char *IR4L_, unsigned char *IR4H_);
extern void hexdec_long( uint32_t count );
extern void setCutoffFrequency(uint8_t frequency);
extern void SoftReset(void);
extern void IntrrptSourceSet(void);
extern void ECNTL1_rst (void);
extern float getTemperature_AK9753(unsigned char *sgn);
extern int HTTPPostMethod_SQL_delete(HTTPCli_Handle httpClient);
extern void GPIOs2IntHandler();
extern void Button_IF_EnableInterrupt(unsigned char ucSwitch);
extern void Button_IF_Init(P_INT_HANDLER S2InterruptHdl,P_INT_HANDLER S3InterruptHdl );
extern void no_conn (void);
extern int write_cmmnd (unsigned char *pucData, unsigned char ucLen, unsigned char ucStop);
extern int read_range(unsigned char ucRegAddr, unsigned char *pucRegValue);
extern int ReportUART1(const char *pcFormat, ...);
extern int ts_write_cmmnd (unsigned char commnd);
extern int ts_read_range(unsigned char *pucRegValue);
extern int ts1_write_cmmnd (unsigned char commnd);
extern int ts1_read_range(unsigned char *pucRegValue);
extern void door_open(void);
extern void scan_IR(void);
extern void alarm (void);
extern void address (unsigned char *Databuf);

//extern void data_init (void);
extern float adc_read (unsigned long* pulAdcSamples, unsigned int len);

extern void sonar_cycle_pwr (void);
extern double sonar_sensr1(unsigned long int *mean);
extern double sonar_sensr2(unsigned long int *mean);
void prnt_sonar (double st_dev1, double st_dev2, unsigned long int mean_SNSR1, unsigned long int mean_SNSR2);

//*****************************************************************************

// Application specific status/error codes
typedef enum{
 /* Choosing this number to avoid overlap with host-driver's error codes */
    DEVICE_NOT_IN_STATION_MODE = -0x7D0,       
    DEVICE_START_FAILED = DEVICE_NOT_IN_STATION_MODE - 1,
    INVALID_HEX_STRING = DEVICE_START_FAILED - 1,
    TCP_RECV_ERROR = INVALID_HEX_STRING - 1,
    TCP_SEND_ERROR = TCP_RECV_ERROR - 1,
    FILE_NOT_FOUND_ERROR = TCP_SEND_ERROR - 1,
    INVALID_SERVER_RESPONSE = FILE_NOT_FOUND_ERROR - 1,
    FORMAT_NOT_SUPPORTED = INVALID_SERVER_RESPONSE - 1,
    FILE_OPEN_FAILED = FORMAT_NOT_SUPPORTED - 1,
    FILE_WRITE_ERROR = FILE_OPEN_FAILED - 1,
    INVALID_FILE = FILE_WRITE_ERROR - 1,
    SERVER_CONNECTION_FAILED = INVALID_FILE - 1,
    GET_HOST_IP_FAILED = SERVER_CONNECTION_FAILED  - 1,
    
    STATUS_CODE_MAX = -0xBB8
}e_AppStatusCodes;

//*****************************************************************************
//                          MACROS
//*****************************************************************************
#define MAX_STRING_LENGTH    80
#define CONSOLE              UARTA0_BASE
#define UartGetChar()        MAP_UARTCharGet(CONSOLE)
#define UartPutChar(c)       MAP_UARTCharPut(CONSOLE,c)
#define MAX_STRING_LENGTH    80
volatile int g_iCounter = 0;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile tBoolean g_bFeedWatchdog = true;
//volatile unsigned long g_ulWatchdogCycles;

#if defined(ccs)
extern void (* const g_pfnVectors[])(void);
#endif
#if defined(ewarm)
extern uVectorEntry __vector_table;
#endif

