attacker145/CC3200-Client/main_v42x.c
    return lRetVal;
}

//*****************************************************************************
//
//! \brief HTTP GET Demonstration
//!
//! \param[in]  httpClient - Pointer to http client
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int HTTPGetMethod(HTTPCli_Handle httpClient)
{
  
    long lRetVal = 0;
    /*
     * GET /get.php HTTP/1.1
     * This line specifies an HTTP command, called a method, followed by the address of a
     * document and the version of the HTTP protocol being used. In this case, the request
     * is using the GET method to ask for the index.html document using HTTP 1.1. After
     * this initial line, the request can contain optional header information that gives the server
     * additional data about the request. For example:
     * User-Agent: Mozilla/5.0 (Windows 2000; U) Opera 6.0 [en]
     *
     */

    //GET /get.php HTTP/1.1
    // optional header information that gives the server additional data about the request.
    //Accept: image/gif, image/jpeg, text/*, */* <---- "*/*" indicating all media types

    HTTPCli_Field fields[4] = {
                                {HTTPCli_FIELD_NAME_HOST, HOST_NAME},
                                {HTTPCli_FIELD_NAME_ACCEPT, "*/*"}, //Accept: image/gif, image/jpeg, text/*, */*
                                {HTTPCli_FIELD_NAME_CONTENT_LENGTH, "0"},
                                {NULL, NULL}
                            };
    bool        moreFlags;
    
    
    /* Set request header fields to be send for HTTP request. */
    HTTPCli_setRequestFields(httpClient, fields);

    /* Send GET method request. */
    /* Here we are setting moreFlags = 0 as there are no more header fields need to send
       at later stage. Please refer HTTP Library API documentaion @ HTTPCli_sendRequest
       for more information.
    */
    moreFlags = 0;

    /*
     * Here we are setting moreFlags = 1 as there are some more header fields need to send
     * other than setted in previous call HTTPCli_setRequestFields() at later stage.
     * Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
     */
    //moreFlags = 1;
    lRetVal = HTTPCli_sendRequest(httpClient, HTTPCli_METHOD_GET, GET_REQUEST_URI, moreFlags);
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to send HTTP GET request.\n\r");
        return lRetVal;
    }

     lRetVal = readResponse(httpClient);    //Currently returns all the text from get.html with text formatting (prints data to a serial port)
     if(lRetVal < 0)
     {
         UART_PRINT("Failed to send HTTP GET request.\n\r");
         //return lRetVal;
     }
    return lRetVal;
}
#endif
/*!
    \brief This function read respose from server and dump on console
    \param[in]      httpClient - HTTP Client object
    \return         0 on success else -ve
    \note
    \warning
    Called from HTTPGetPageMethod method
*/
static int readPageResponse(HTTPCli_Handle httpClient)//Read data.txt page
{

    long lRetVal = 0;
    int bytesRead = 0;
    int id = 0;
    unsigned long len = 0;
    int json = 0;
    char *dataBuffer=NULL;
    bool moreFlags = 1;
    //char * str1;
    //char * str2;
    const char *ids[4] = {
                            HTTPCli_FIELD_NAME_CONTENT_LENGTH,
                            HTTPCli_FIELD_NAME_CONNECTION,
                            HTTPCli_FIELD_NAME_CONTENT_TYPE,
                            NULL
                         };

    /* Read HTTP POST request status code. Server status */
    lRetVal = HTTPCli_getResponseStatus(httpClient);
    if(lRetVal > 0)
    {
        //UART_PRINT("\n\r --------------Read Page Response------------\n\r");
        switch(lRetVal)
        {
        case 200:
        {
            UART_PRINT("HTTP Status 200");

            HTTPCli_setResponseFields(httpClient, (const char **)ids);

            while((id = HTTPCli_getResponseField(httpClient, (char *)g_buff, sizeof(g_buff), &moreFlags))
                    != HTTPCli_FIELD_ID_END)
            {
                //(char *)g_buff - value Field value string.

                switch(id)
                {
                case 0: /* HTTPCli_FIELD_NAME_CONTENT_LENGTH, case 0 server sent number of bytes in the response*/
                {
                    len = strtoul((char *)g_buff, NULL, 0);
                    //UART_PRINT("\n\rHTTPCli_FIELD_NAME_CONTENT_LENGTH\n\r");
                    UART_PRINT(", Number of characters received: %d", len);// Print number of characters that will be sent by the server
                }
                break;
                case 1: /* HTTPCli_FIELD_NAME_CONNECTION */
                {
                    //UART_PRINT("\n\rHTTPCli_FIELD_NAME_CONNECTION\n\r");
                    UART_PRINT(", Connection name: %s", g_buff);
                }
                break;
                case 2: /* HTTPCli_FIELD_NAME_CONTENT_TYPE. Content of the response */
                {

                    //UART_PRINT("\n\r HTTPCli_FIELD_NAME_CONTENT_TYPE\n\r");
                    UART_PRINT(", Content type : %s", g_buff);// Print Content of the response
                    if(!strncmp((const char *)g_buff, "application/json",
                            sizeof("application/json")))
                    {
                        json = 1;
                        UART_PRINT(", g_buff == application/json");
                    }
                    else
                    {
                        json = 0;
                    }
                }
                break;
                default:
                {
                    UART_PRINT(", Wrong filter id");
                    lRetVal = -1;
                    goto end;
                }
                }
            }
            bytesRead = 0;
            if(len > sizeof(g_buff))
            {
                dataBuffer = (char *) malloc(len);
                if(dataBuffer)
                {
                    UART_PRINT("\n\r Failed to allocate memory \n\r");
                    lRetVal = -1;
                    goto end;
                }
            }
            else
            {
                dataBuffer = (char *)g_buff;
            }
            bytesRead = HTTPCli_readResponseBody(httpClient, (char *)dataBuffer, len, &moreFlags);
            if(bytesRead < 0)
            {
                UART_PRINT("\n\r Failed to received response body\n\r");
                lRetVal = bytesRead;
                goto end;
            }
            else if( bytesRead < len || moreFlags)
            {
                UART_PRINT("\n\r Mismatch in content length and received data length\n\r");
                goto end;
            }
            dataBuffer[bytesRead] = '\0';
            UART_PRINT(", Text from /webapp/CC3200command.php ");
            char *output = NULL;

