attacker145/CC3200-Client/main_v42x.c
    return 0;
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void
DisplayBanner(char * AppName)
{
    UART_PRINT("\n\n\n\r");
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\t\t      CC3200 %s Application       \n\r", AppName);
    UART_PRINT("\t\t *************************************************\n\r");
    UART_PRINT("\n\n\n\r");
}


//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void
BoardInit(void)
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
  //
  // Set vector table base
  //
#if defined(ccs) || defined(gcc)
    MAP_IntVTableBaseSet((unsigned long)&g_pfnVectors[0]);
#endif
#if defined(ewarm)
    MAP_IntVTableBaseSet((unsigned long)&__vector_table);
#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable(FAULT_SYSTICK);

    PRCMCC3200MCUInit();
}

// Temperature
//###################################################################################

//****************************************************************************
//                      LOCAL FUNCTION DEFINITIONS
//****************************************************************************
//static int GetRegisterValue_temp(unsigned char ucRegAddr,
//                            unsigned short *pusRegValue);
//static double ComputeTemperature(double dVobject, double dTAmbient);

extern int GetRegisterValue_temp_(unsigned char ucRegAddr,
                            unsigned short *pusRegValue);
extern double ComputeTemperature_(double dVobject, double dTAmbient);

//****************************************************************************
//
//! Compute the temperature value from the sensor voltage and die temp.
//!
//! \param dVobject is the sensor voltage value
//! \param dTAmbient is the local die temperature
//!
//! This function
//!    1. Computes the temperature from the VObject and TAmbient values
//!
//! \return 0: Success, < 0: Failure.
//
//****************************************************************************
double ComputeTemperature(double dVobject, double dTAmbient)
{
    //
    // This algo is obtained from
    // http://processors.wiki.ti.com/index.php/SensorTag_User_Guide
    // #IR_Temperature_Sensor
    //
    double Tdie2 = dTAmbient + 273.15;
    const double S0 = 6.4E-14;            // Calibration factor
    const double a1 = 1.75E-3;
    const double a2 = -1.678E-5;
    const double b0 = -2.94E-5;
    const double b1 = -5.7E-7;
    const double b2 = 4.63E-9;
    const double c2 = 13.4;
    const double Tref = 298.15;
    double S = S0*(1+a1*(Tdie2 - Tref)+a2*pow((Tdie2 - Tref),2));
    double Vos = b0 + b1*(Tdie2 - Tref) + b2*pow((Tdie2 - Tref),2);
    double fObj = (dVobject - Vos) + c2*pow((dVobject - Vos),2);
    double tObj = pow(pow(Tdie2,4) + (fObj/S),.25);
    tObj = (tObj - 273.15);
    return tObj;
}

//######################################################################################
int main()
{

    long lRetVal = -1;
    float sensorTemp;
    tBoolean bRetcode;
    HTTPCli_Struct httpClient;
    unsigned int t_cntr = 0;
    unsigned int t_cntr1 = 0;
    unsigned int f_cntr = 0;
    unsigned char IR1L_ = 0;
    unsigned char IR1H_ = 0;
    unsigned char IR2L_ = 0;
    unsigned char IR2H_ = 0;
    unsigned char IR3L_ = 0;
    unsigned char IR3H_ = 0;
    unsigned char IR4L_ = 0;
    unsigned char IR4H_ = 0;
    unsigned int IR1 = 0;
    unsigned int IR2 = 0;
    unsigned int IR3 = 0;
    unsigned int IR4 = 0;
    unsigned char cnn_fail = 0;
    int cx;
    unsigned long int mean_SNSR1;
    unsigned long int mean_SNSR2;
    double st_dev1;
    double st_dev2;
    unsigned long int SNSR1_mean[10];
    unsigned long int SNSR2_mean[10];
    unsigned char i, y, cntr;
    _u8 macAddressVal[SL_MAC_ADDR_LEN];
    _u8 macAddressLen = SL_MAC_ADDR_LEN;

    BoardInit();// Board Initialization

    sonar_cycle_pwr ();// 5sec off pins start to initialize here

    PinMuxConfig();// Configure the pinmux settings for the peripherals exercised

    //
    // Serial Configuring UART0
    //
    InitTerm();
    InitTermUART1();

    DisplayBanner(APP_NAME);// Display banner

    //
    // Set up the watchdog interrupt handler.
    //
    WDT_IF_Init(WatchdogIntHandler, MILLISECONDS_TO_TICKS(WD_PERIOD_MS));

    bRetcode = MAP_WatchdogRunning(WDT_BASE);
    if(!bRetcode)
    {
       WDT_IF_DeInit();
    }
    //WDT_IF_DeInit();
    //SET MAC address
    GPIO_IF_GetPortNPin(SH_GPIO_13,&uiGPIOPort,&pucGPIOPin);//Read SW3. If button is pressed set MAC address
    ucPinValue = GPIO_IF_Get(SH_GPIO_13,uiGPIOPort,pucGPIOPin);
    if (ucPinValue == 1){
        sl_Start(NULL,NULL,NULL);
        _u8 MAC_Address[6];
        MAC_Address[0] = 0x10;
        MAC_Address[1] = 0x12;
        MAC_Address[2] = 0x28;
        MAC_Address[3] = 0x22;
        MAC_Address[4] = 0x69;
        MAC_Address[5] = 0x19;
        sl_NetCfgSet(SL_MAC_ADDRESS_SET,1,SL_MAC_ADDR_LEN,(_u8 *)MAC_Address);
        sl_Stop(0);
        UART_PRINT("\nMAC is set: %d", MAC_Address);
    }

   //
   // I2C Init
   //
   //lRetVal = I2C_IF_Open(I2C_MASTER_MODE_FST);
   lRetVal = I2C_IF_Open(I2C_MASTER_MODE_STD);

   if(lRetVal < 0)
   {
      ERR_PRINT(lRetVal);
      LOOP_FOREVER();
   }

//*********************************************************************************************
   //AK975X
#ifdef AK975
   MAP_UtilsDelay(3);                                                                       //*
   SoftReset();                                                                             //*
   IntrrptSourceSet();                                                                      //*
   ECNTL1_rst ();//ECNTL1 reset to 0                                                        //*
   setCutoffFrequency(AK975X_FREQ_0_6HZ);   //AK975X_FREQ_0_3HZ = 000                       //*
   AK975XsetMode(AK975X_MODE_0); //Set to continuous read   1000                            //*
   AK9753_ID ();                                                                            //*
#endif
//*********************************************************************************************

