attacker145/CC3200-Client/main_v42x.c
     init_adc ();
     UART_PRINT("\nADC is initialized.");

     lRetVal = TMP006DrvOpen_();
     if(lRetVal < 0)
     {
        ERR_PRINT(lRetVal);
         //LOOP_FOREVER();
        while (1){
            g_bFeedWatchdog = true;
        }
     }

     lRetVal = BMA222Open_();
     if(lRetVal < 0)
     {
        ERR_PRINT(lRetVal);
        //LOOP_FOREVER();
        while (1){
            g_bFeedWatchdog = true;
        }
     }

    AccSample_(); // Just do a single reading for now. TODO: Make Async.
    SetAccAvg_(); // g_accXAvg, g_accYAvg, g_accZAvg, g_accTotalAvg

    TMP006DrvGetTemp_(&sensorTemp);

#define cloud
#ifdef cloud
    InitializeAppVariables();
    lRetVal = ConnectToAP();
    if(lRetVal < 0)//Could not connect to AP
    {
        UART_PRINT("\n\rCouldn't connect to AP.\n\r");//
        cnn_fail = 1;
        //EnterHIBernate();
    }else{
        lRetVal = ConnectToHTTPServer(&httpClient);
        if(lRetVal < 0){
            UART_PRINT("\n\rFailed to connect to a remote server.\n\r");
            cnn_fail = 1;
           //EnterHIBernate();
        }
    }
#endif

    unsigned char Databuf [] = {170, 165, 100};
    GPIO_IF_GetPortNPin(SH_GPIO_22,&uiGPIOPort,&pucGPIOPin);//Read SW2. If button is pressed send the sequence
    ucPinValue = GPIO_IF_Get(SH_GPIO_22,uiGPIOPort,pucGPIOPin);
    if (ucPinValue == 1){
        address (Databuf);
        UART_PRINT("\nAddress programmed ");
        while(1){
            g_bFeedWatchdog = true;

            MAP_UtilsDelay(1280000);
        }
    }

    sl_NetCfgGet(SL_MAC_ADDRESS_GET,NULL,&macAddressLen,(_u8 *)macAddressVal);
    UART_PRINT("\nMAC: %d \n\r", macAddressVal);

    i = 0;
#ifdef light
    GPIO_IF_GetPortNPin(SH_GPIO_6,&uiGPIOPort,&pucGPIOPin);//PIN61
    Door = GPIO_IF_Get(SH_GPIO_6,uiGPIOPort,pucGPIOPin);// Read the door
#endif
    //----------------------------------------------------------------------------------------------------------
    while(1){
        g_bFeedWatchdog = true;
        TMP006DrvGetTemp_(&sensorTemp);
#define snr
#ifdef snr
        st_dev1 = sonar_sensr1(&mean_SNSR1);
        st_dev2 = sonar_sensr2(&mean_SNSR2);
        prnt_sonar (st_dev1, st_dev2, mean_SNSR1, mean_SNSR2);
#endif
#ifdef AK975
        //Read GPIO12: AK9753A INT
        GPIO_IF_GetPortNPin(SH_GPIO_12,&uiGPIOPort,&pucGPIOPin);    // Computes port and pin number from the GPIO number
        ucPinValue = GPIO_IF_Get(SH_GPIO_12,uiGPIOPort,pucGPIOPin); // Read pin status of GPIO22
        if(ucPinValue == 0){
            AK9753AReadData(&IR1L_, &IR1H_, &IR2L_, &IR2H_, &IR3L_, &IR3H_, &IR4L_, &IR4H_);    //*
            //roomtemp = getTemperature_AK9753(&sgn);
        }                                                                                      //*
        //UART_PRINT(", RT =");                                                                //*
        //if ((sgn == '+') && (roomtemp < 60))                                                 //*
        //    UART_PRINT(" +%f", roomtemp);                                                    //*
        //else
        //    UART_PRINT("NA");
        //if ((sgn == '-') && (roomtemp < 60))                                                 //*
        //    UART_PRINT(" -%f", roomtemp);                                                    //*
        //else
        //    UART_PRINT("NA");
       IR1 = IR1H_; IR1 = IR1 << 8;                                                             //*                                                                                 //*
       IR1 = IR1 + (unsigned int)IR1L_;                                                         //*
       IR2 = IR2H_; IR2 = IR2 << 8;                                                             //*                                                                                                //*
       IR2 = IR2 + (unsigned int)IR2L_;                                                         //*
       IR3 = IR3H_; IR3 = IR3 << 8;                                                             //*
       IR3 = IR3 + (unsigned int)IR3L_;                                                         //*
       IR4 = IR4H_; IR4 = IR4 << 8;                                                             //*
       IR4 = IR4 + (unsigned int)IR4L_;                                                         //*                                                                                                     //*
       //gcvt(roomtemp, 6, buf); sensorTemp
       //sprintf(rtbuf, "%.2f", roomtemp);
       GPIO_IF_GetPortNPin(SH_GPIO_9,&uiGPIOPort,&pucGPIOPin);
       ucPinValue = GPIO_IF_Get(SH_GPIO_9,uiGPIOPort,pucGPIOPin);
       if (ucPinValue == 1){
           cx = snprintf(buf, 109, "IR1=%.0f & IR2=%.0f & IR3=%.0f & IR4=%.0f & RoomT=%.2f & TName=controllall & BLE=ON & ms=%X",
                         (float)IR1,
                         (float)IR2,
                         (float)IR3,
                         (float)IR4,
                         sensorTemp,
                         (char*)macAddressVal);//cx is indice of the last buf[cx]. buff has all the data to be transferred
       }else{
           cx = snprintf(buf, 109, "IR1=%.0f & IR2=%.0f & IR3=%.0f & IR4=%.0f & RoomT=%.2f & TName=controllall & BLE=OFF & ms=%X",
                         (float)IR1,
                         (float)IR2,
                         (float)IR3,
                         (float)IR4,
                         sensorTemp,
                         (char*)macAddressVal);//cx is indice of the last buf[cx]. buff has all the data to be transferred
       }
#endif

#ifdef snr
       if (st_dev1 > 10){//Capture motion
           strcpy ( &buf[cx], " & temp=X");
       }
       if (st_dev2 > 10){//Capture motion
           strcpy ( &buf[cx], " & light=X");
       }
#endif

#ifdef cloud
        if(t_cntr > 30){//10sec
            if(cnn_fail == 0){
                t_cntr = 0;
                lRetVal = HTTPPostMethod_data(&httpClient);//Reads page responce: lRetVal = readResponse(httpClient); commented out
                if(lRetVal < 0){// If failed post data to the web-page
                    f_cntr++;
                    UART_PRINT(" Failed Post Method  ");
                    //EnterHIBernate();
                }
            }
            if (i==9){
                for(y = 0; y < 9; y++){
                    for (i = 0; i < 9; i++){//10 samples
                        if(SNSR1_mean[y] != SNSR1_mean[i]){
                            cntr++;
                        }
                    }
                }
                if (cntr > 3){
                    UART_PRINT(" Possible Fall ");
                }

                for(y = 0; y < 9; y++){
                    for (i = 0; i < 9; i++){//10 samples
                        if(SNSR2_mean[y] != SNSR2_mean[i]){
                            cntr++;
                        }
                    }
                }
                if (cntr > 3){
                    UART_PRINT(" Possible Fall ");
                }
                i = 0;// reset counter
            }else{
                i++;
            }
            SNSR1_mean[i] = mean_SNSR1;
            SNSR2_mean[i] = mean_SNSR2;
        }

        if(t_cntr1 > 10){
            UART_PRINT("buf:%s \n\r", buf);
            lRetVal = HTTPGetPageMethod(&httpClient);
            if(lRetVal < 0){
                UART_PRINT(" Failed Get Method");
                f_cntr++;
                //EnterHIBernate();
            }
            t_cntr1 = 0;
        }
        t_cntr++;
        t_cntr1++;

        //MAP_UtilsDelay(1280000);
        MAP_UtilsDelay(1280000);
#endif

#ifdef cloud
        if (f_cntr > 3){
            UART_PRINT(" Looks like a connection problem. Resetting...  ");
            EnterHIBernate();
        }
#endif
    }

}
